---
kind: type
id: T:Autodesk.Revit.DB.ViewShapeBuilder
source: html/f99edd24-4519-56d5-a5d6-aa1565a893af.htm
---
# Autodesk.Revit.DB.ViewShapeBuilder

Builds and verifies a view-specific shape representation that would typically be stored in a DirectShape object.
 Currently limited to curve-based representations for plan and elevation views.

## Syntax (C#)
```csharp
public class ViewShapeBuilder : ShapeBuilder
```

## Remarks
The validation functionality is used by DirectShape to validate the incoming shape.